#include <stdio.h>
#include <stdlib.h>
// int main()
// {
//     int a = -1;
//     int b = a >> 1;
//     printf("%d", b);
//     return 0;

// }

//算数操作符+ - * /
// int main()
// {
//     double a = 5 / 2.0;//除%外都可用浮点数，%操作数必须为整数返回余
//     printf("%lf\n", a);
//     return 0;
// }

//移位操作符(算数右移(补原符号位)、逻辑右移（补0）)一般算数
// int main()
// {
//     int a = -16;//移动二进制位
//     //00000000000000000000000000001000
//     int b = a >> 1;
//     //0 0000000000000000000000000000100相当于（/2）//正整数原反补三码相同
//     printf("%d\n", b);
//      return 0;
// }
// int main()
// {
//     int a = 5;
//     int b = a << 1;
//     printf("%d\n", b);//左移补0相当于（*2）//不要移动负数位作用于整数
//     return 0;
// }

// int main()//&按位与，有0为0
//     int a = 3;  //00000000000000000000000000000011
//     int b = 5;  //00000000000000000000000000000101
//     int c = a&b;//00000000000000000000000000000001
//     printf("%d\n", c);
//     return 0;
// }

// int main()//|按位或，有一为一
// {
//     int a = 3;  //00000000000000000000000000000011
//     int b = 5;  //00000000000000000000000000000101
//     int c = a|b;//00000000000000000000000000000111
//     printf("%d\n", c);
//     return 0;
// }

// int main()//^按位异或，相同为0相异为一
// {
//     int a = 3;  //00000000000000000000000000000011
//     int b = 5;  //00000000000000000000000000000101
//     int c = a^b;//00000000000000000000000000000110
//     printf("%d\n", c);
//     return 0;
// }

// int main()//不创建第三变量，交换//效率不如创建第三变量
// {
//     int a = 3;
//     int b = 5;
//     a = a^b;
//     b = a^b;
//     a = a^b;
//     printf("%d\n%d", a, b);
//     return 0;
// }

// int main()//统计二进制码有多少个1
// {
//     int i = 0;
//     int count = 0;
//     scanf("%d", &i);
//     for (int n = 0; n < 32; n++)
//     {
//         if (((i >> n) & 1) == 1)
//             count++;
//     }
//     printf("%d\n", count);
//     return 0;
// }

//赋值操作符 = ==
//复合操作符+= -= *=   /= %= >>= <<= &=  |= ^=
//单目操作符
// ！ 逻辑反操作
// - 负值
// + 正值
// & 取地址
// sizeof 类型长度
// ~ 二进制取反
// -- 前后
// ++ 前后
// * 解应用
// （类型） 强制类型转换
// int main()
// {
//     // int a = 10;
//     // int* p = &a;
//     // *p = 20;
//     // printf("%d\n",a);

//     // int a = 10;//sizeof（不参加运算）
//     // char c = 'r';
//     // char* p = &c;
//     // int arr[10] = {0};
//     // printf("%d\n", sizeof a);//4//可以省略括号
//     // printf("%d\n", sizeof(int));//4
//     // printf("%d\n", sizeof(c));//1
//     // printf("%d\n", sizeof(char));//1
//     // printf("%d\n", sizeof(p));// 4\8
//     // printf("%d\n", sizeof(char*));//4\8
//     // printf("%d\n", sizeof(arr));//40
//     // printf("%d\n", sizeof(int [10]));//40//去掉数组名即数组类型

//     //关系操作符 > >= < <= != ==
//     //逻辑操作符 && ||
//     //条件操作符 exp1 ? exp2 : exp3

//     return 0;
// }
//     //逗号表达式 exp1, exp2, exp3, ...expN整个结果为最后一个表达式结果
//     //[]下标引用操作符、()函数调用操作符、结构体
// struct Stu
// {
//     char name[20];
//     int age;
//     char id[20];
// };
// int main()
// {
//     int a = 10;
//     struct Stu s1 = {"张三", 20, "202020202"};//使用了struct Stu这个类型创建了对象s1，并初始化
//     printf("%s\n", s1.name);//(结构体.成员名)//=
//     printf("%d\n", s1.age);
//     printf("%s\n", s1.id);
//     struct Stu* ps = &s1;
//     printf("%s\n", (*ps).name);//=
//     printf("%s\n", ps->name);
//     return 0;
// }
//表达式求值：顺序一部分是由操作符优先级和结合性决定，求值可能需要转换类型
//隐式类型转换
//整型提升
int main()
{
    // char a = 3;//00000000000000000000000000000011
    // //00000011
    // char b = 127;//0000000000000000000000001111111
    // //01111111
    // char c = a +b;//0000000000000000000000010000010
    // //10000010
    // //11111111111111111111111110000010补码（按照变量数据类型符号位提升）
    // //11111111111111111111111110000001反码（-1）
    // //00000000000000000000000001111110原码-126
    // printf("%d\n", c);

    // char c = 1;
    // printf("%d\n", sizeof(c));//1
    // printf("%d\n", sizeof(+c));//4发生运算整型提升
    // printf("%d\n", sizeof(!c));//1

    //算术转换
    // long double
    // double
    // float
    // unsigned long int
    // long int
    // int向上转换

    //操作符属性：优先级、结合性、是否控制求值顺序
    
    return 0;
}